app/controllers/videos_controller.rb

	def index
		@videos = current_user.videos.where(approved: true)
---
SELECT "videos".* FROM "videos" WHERE "videos"."user_id" = ? AND "videos"."approved" = ?  [["user_id", 2], ["approved", true]]